## Test 06: capacity [1 pts]

Tests the set_capacity function

### Subtest 01: 
```
elist.c:43:elist_create(): Initializing new elist: capacity = [1], item_sz=[4], bytes[4]
elist.c:84:elist_set_capacity(): Setting capacity: list->capacity = [1000000], capacity = [1000000], size = [0], item_sz = [4]

> Assertion: total == 1783293664 [  OK  ]
> total: 1783293664
elist.c:84:elist_set_capacity(): Setting capacity: list->capacity = [1000], capacity = [1000], size = [1000], item_sz = [4]

> Assertion: total == 499500 [  OK  ]
> total: 499500
elist.c:84:elist_set_capacity(): Setting capacity: list->capacity = [10], capacity = [10], size = [10], item_sz = [4]

> Assertion: total == 45 [  OK  ]
> total: 45
elist.c:84:elist_set_capacity(): Setting capacity: list->capacity = [100], capacity = [100], size = [10], item_sz = [4]

> Assertion: total == 45 [  OK  ]
> total: 45
elist.c:84:elist_set_capacity(): Setting capacity: list->capacity = [1], capacity = [1], size = [0], item_sz = [4]
elist.c:84:elist_set_capacity(): Setting capacity: list->capacity = [1], capacity = [1], size = [1], item_sz = [4]
elist.c:84:elist_set_capacity(): Setting capacity: list->capacity = [2], capacity = [2], size = [1], item_sz = [4]

> Assertion: total == 11 [  OK  ]
> total: 11

> Assertion: size == 2 [  OK  ]

--> Subtest passed
```

